// Напишите метод, который сжимает строку. Пример: вход aaaabbbcdd.
// Вывод: a4b3c1d2 для примера

import java.util.Scanner;

public class task2 {
    public static void main(String[] args) {
        Scanner scan = new Scanner(System.in);
    System.out.print("Введите строку: ");
    String str = scan.nextLine();
    scan.close();
    
    }
    
}
